/* XTIT: Info Screen text when applying the NUIStyleSheet. */
"applyNUIStyleSheetApplyStepInfoScreenText" = "NUIStyleSheet:n käyttö.";

/* XTIT: Info Screen text when applying the SAP Mobile Services LogSettings. */
"applySAPcpmsLogSettingsStepInfoScreenText" = "SAP Mobile Services LogSettingsin käyttö.";

/* XFLD: Text information if the provided credentials were invalid. */
"authenticationFailedMessage" = "Todentaminen epäonnistui.";

/* XTIT: Info Screen text before presenting the Basic Authentication view. */
"basicAuthenticationStepInfoScreenText" = "Validoidaan tunnistetietoja.";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the onboarding flow. */
"cancelAlertControllerTitleText" = "Haluatko varmasti peruuttaa käyttöönottoprosessin?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the restore flow. */
"cancelRestoreAlertControllerTitleText" = "Haluatko varmasti peruuttaa palauttamisprosessin?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the reset passcode flow. */
"cancelResetPasscodeAlertControllerTitleText" = "Haluatko varmasti peruuttaa pääsykoodin palauttamisprosessin?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the authentication process. */
"cancelAuthenticationProcessAlertControllerTitleText" = "Haluatko varmasti peruuttaa todentamisprosessin?";

/* Title of Alert window when asking for confirmation about triggering the reset passcode flow. */
"resetPasscodeAlertControllerTitleText" = "Haluatko varmasti palauttaa pääsykoodin?";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the passcode change flow. */
"cancelPasscodeChangeControllerTitleText" = "Haluatko varmasti peruuttaa pääsykoodin muutosprosessin?";

/* XTIT: Title of Alert window when asking for confirmation about reset the application. */
"cancelPasscodeControllerTitleText" = "Haluatko varmasti palauttaa sovelluksen?";

/* XTIT: Info Screen text when running the Composite Steps. */
"compositeStepInfoScreenText" = "Yhdistetyt askeleet.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services ClientResources. */
"downloadSAPcpmsClientResourcesStepInfoScreenText" = "SAP Mobile Services ClientResources -moduulin paikallinen lataus.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services Destinations. */
"downloadSAPcpmsDestinationsStepInfoScreenText" = "SAP Mobile Services -kohteiden paikallinen lataus.";

/* XTIT: Info Screen text when downloading the SAP Mobile Services Settings. */
"downloadSAPcpmsSettingsStepInfoScreenText" = "SAP Mobile Services -asetusten paikallinen lataus.";

/* XBUT: Text of button on FUIFeedbackScreen when the Face ID got disabled by passcode policy. */
"fuiFeedbackDisableFaceIDButtonText" = "Jatka";

/* XBUT: Text of button on FUIFeedbackScreen when the Touch ID is disabled by the new passcode policy */
"fuiFeedbackDisableTouchIDButtonText" = "Jatka";

/* XBUT: Text of button on FUIFeedbackScreen when the Face ID is enabled by the new passcode policy */
"fuiFeedbackEnableFaceIDButtonText" = "Aktivoi";

/* XBUT: Text of button on FUIFeedbackScreen when the Touch ID is enabled by the new passcode policy */
"fuiFeedbackEnableTouchIDButtonText" = "Aktivoi";

/* XTIT: FUIFeedbackScreen headline description text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDDetailDescription" = "Käytä pääsykoodia, kun kirjaudut seuraavan kerran.";

/* XTIT: FUIFeedbackScreen headline text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDHeadlineDescription" = "Kasvontunnistus ei enää ole käytettävissä";

/* XTIT: FUIFeedbackScreen title text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableFaceIDTitleText" = "Käytännön muutokset";

/* XTIT: FUIFeedbackScreen headline description text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDDetailDescription" = "Käytä pääsykoodia, kun kirjaudut seuraavan kerran.";

/* XTIT: FUIFeedbackScreen headline text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDHeadlineDescription" = "Kosketustunnus ei enää ole käytettävissä";

/* XTIT: FUIFeedbackScreen title text when touchID is disabled by the new passcode policy. */
"fuiFeedbackScreenDisableTouchIDTitleText" = "Käytännön muutokset";

/* XTIT: FUIFeedbackScreen detail description text when faceID is disabled by the new passcode policy. */
"fuiFeedbackScreenEnableFaceIDDetailDescription" = "Voit ottaa tämän toiminnon käyttöön tai poistaa sen käytöstä milloin tahansa kohdassa Asetukset.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy changed and face ID is enabled. */
"fuiFeedbackScreenEnableFaceIDHeadlineDescription" = "Kasvontunnistus on nyt käytettävissä. Kun aktivoit kasvontunnistuksen, saat tietosi nopeammin käyttöösi.";

/* XTIT: FUIFeedbackScreen title text when Face ID is enabled in the new passcode policy. */
"fuiFeedbackScreenEnableFaceIDTitleText" = "Kasvontunnistus";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenEnableTouchIDDetailDescription" = "Voit ottaa tämän toiminnon käyttöön tai poistaa sen käytöstä milloin tahansa kohdassa Asetukset.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy changed and touch ID is enabled. */
"fuiFeedbackScreenEnableTouchIDHeadlineDescription" = "Kosketustunnus on nyt käytettävissä. Kun aktivoit kosketustunnuksen, saat tietosi nopeammin käyttöösi.";

/* XTIT: FUIFeedbackScreen title text when touchID is enabled by the new passcode policy. */
"fuiFeedbackScreenEnableTouchIDTitleText" = "Kosketustunnus";

/* XBUT: Text of button on FUIFeedbackScreen when passcode change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedActionButtonText" = "Jatka";

/* XMSG: FUIFeedbackScreen description when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedDescriptionLabel" = "Luo uusi pääsykoodi.";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedHeadlineText" = "Pääsykoodikäytäntö on muuttunut";

/* XTIT: FUIFeedbackScreen title text when passcode policy change is necessary. */
"fuiFeedbackScreenPasscodePolicyChangedTitleText" = "Käytännön muutokset";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeAndFaceIDDetailDescription" = "Tästä lähtien pääsykoodia ja kasvontunnistusta ei enää vaadita kirjautumisessa. \n\n Pääset sovellukseen suoraan.";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeAndTouchIDDetailDescription" = "Tästä lähtien pääsykoodia ja kosketustunnusta ei enää vaadita kirjautumisessa. \n\n Pääset sovellukseen suoraan.";

/* XBUT: Text of button on FUIFeedbackScreen when the passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeButtonText" = "OK";

/* XTIT: FUIFeedbackScreen headline description text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeDetailDescription" = "Tästä lähtien pääsykoodia ei enää vaadita kirjautumisessa. \n\n Pääset sovellukseen suoraan.";

/* XTIT: FUIFeedbackScreen headline text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeHeadlineDescription" = "Kirjautumiskäytäntö on muuttunut";

/* XTIT: FUIFeedbackScreen title text when passcode policy is turned off on the server. */
"fuiFeedbackScreenTurnOffPasscodeTitleText" = "Ilmoitus";

/* XBUT: Text of button on FUIFeedbackScreen after migration when passcode creation is mandatory. */
"migrationOnlyBiometricIDWasSetPreviouslyButtonText" = "Jatka";

/* XTIT: Description of FUIFeedbackScreen after migration when previously only biometricID was set. */
"migrationOnlyBiometricIDWasSetPreviouslyDescriptionText" = "Tästä versiosta alkaen pääsykoodi on pakollinen. Luo pääsykoodi sovellusta varten.";

/* XTIT: Title of FUIFeedbackScreen after migration when previously only biometricID was set. */
"migrationOnlyBiometricIDWasSetPreviouslyHeadlineText" = "Pääsykoodi on pakollinen";

/* XBUT: Text of No button. */
"noButtonText" = "Ei";

/* XTIT: Info Screen text before presenting the OAuth2 Authentication view. */
"oauth2AuthenticationStepInfoScreenText" = "Validoidaan OAuth 2.0 -tunnistetiedot.";

/* XTIT: Text of PasscodeInputController when user wants to enable face ID. */
"passcodeInputControllerEnableFaceIDText" = "Aktivoi kasvontunnistus syöttämällä pääsykoodi:";

/* XTIT: Text of PasscodeInputController when user wants to enable touch ID. */
"passcodeInputControllerEnableTouchIDText" = "Aktivoi kosketustunnus syöttämällä pääsykoodi:";

/* XTIT: Title of Alert window when asking for confirmation about cancelling the onboarding flow. */
"rejectAlertControllerTitleText" = "Et voi jatkaa käyttöönottoa ilman suostumusta.";

/* XBUT: Text of No button of reject. */
"rejectNoButtonText" = "Anna suostumus";

/* XBUT: Text of Yes button of reject. */
"rejectYesButtonText" = "Lopeta prosessi";

/* XTIT: Info Screen text before presenting the SAML Authentication view. */
"samlAuthenticationStepInfoScreenText" = "Validoidaan SAML-tunnistetiedot.";

/* XTIT: Info Screen text before presenting the SAP Mobile Services UserIdentity Discovery Authentication view. */
"sapcpmsUserIdentityDiscoveryAuthenticationStepInfoScreenText" = "Validoidaan SAP Mobile Services UserIdentity Discovery -tunnistetiedot.";

/* XTIT: Info Screen text before presenting the SLS Authentication view. */
"slsAuthenticationStepInfoScreenText" = "Validoidaan SLS-tunnistetiedot.";

/* XMSG: Message for the user to fill all the fields for authentication. */
"slsFillAllOfTheFieldsErrorMessage" = "Täytä kaikki kentät";

/* XBUT: Text of Yes button. */
"yesButtonText" = "Kyllä";

/* XBUT: Text of Continue button. */
"continueButtonText" = "Jatka";

/* XBUT: Text of Cancel button. */
"cancelButtonText" = "Peruuta";

/* XTIT: Title of Usage Collection Consent onboarding flow. */
"UsageCollectionConsentTitle" = "Käytön keräys";

/* XTIT: Body of Usage Collection Consent onboarding flow. */
"UsageCollectionConsentBody" = "Sovelluksen pääkäyttäjä pyytää, että sallit tietojen keräämisen sovelluksen käytöstä. Saatuja tietoja käytetään sovelluksen parantamiseen. Tietoja kerätä mm. siitä, miten käytät sovellusta, kuinka pitkän aikaa käytät sitä ja miten liikut sovelluksessa.";

/* XTIT: Usage Collection Consent opt-out alert message. */
"usageOptOutAlertMessage" = "Haluatko kieltäytyä?";

/* XTIT: Usage Collection Consent opt-in alert message. */
"usageOptInAlertMessage" = "Haluatko antaa suostumuksesi?";

/* XTIT: Title of Crash Report Collection Consent onboarding flow. */
"CrashReportCollectionConsentTitle" = "Kaatumisraportin koonti";

/* XTIT: Body of Crash Report Collection Consent onboarding flow. */
"CrashReportCollectionConsentBody" = "Sovelluksen pääkäyttäjä pyytää sinua sallimaan tietojen keräämisen, jotta sovelluksen kaatumisia koskeva vianmääritys ja analysointi voidaan tehdä sovelluksen vakauden parantamiseksi. Kerätyt tiedot rajoittuvat kaatumisraportteihin ja laitetietoihin.";

/* XTIT: Title of alert to be shown when QR Digital Signature Verification fails. */
"qrDigitalSignatureVerficationFailedTitle" = "Epäonnistui.";

/* \"XMSG: Message telling that the QR Digital Signature Verification failed.\" */
"qrDigitalSignatureVerficationFailedMessage" = "QR-koodin allekirjoituksen todentaminen epäonnistui.";

/* \"XMSG: Message telling that the QR code signature verification succeeded.\" */
"qrDigitalSignatureVerficationSucceededMessage" = "QR-koodin digitaalinen allekirjoitus todennettu. Sinut yhdistetään kohteeseen:";

/* \"XTIT: Title of InfoScreenPresenter when token expires and authentication fails.\" */
"authenticationErrorTitle" = "Todentamisvirhe";

/* \"XMSG: Message of InfoScreenPresenter when token expires and authentication fails.\" */
"authenticationErrorMessage" = "Sinua ei voitu todentaa. Kirjaudu sisään.";

/* \"XBUT: Text of Error button.\" */
"errorButtonText" = "Virhe";

